tests/load/ws-delivery.yml
config:
  target: "ws://localhost:4000"
  phases:
    # Connect 500 concurrent users
    - duration: 30
      arrivalRate: 50
      name: "Connect users"
    # Maintain connections
    - duration: 120
      arrivalRate: 10
      name: "Maintain connections"
  processor: "./load-test-helpers.js"
  variables:
    conversationId: "test-conversation-id"
  engines:
    socketio:
      transports: ["websocket"]

scenarios:
  - name: "WebSocket message delivery"
    engine: socketio
    flow:
      - function: "generateAuth"
      - emit:
          channel: "join"
          data:
            conversationId: "{{ conversationId }}"
      - think: 1
      - emit:
          channel: "typing"
          data:
            conversationId: "{{ conversationId }}"
            isTyping: true
      - think: 2
      - emit:
          channel: "typing"
          data:
            conversationId: "{{ conversationId }}"
            isTyping: false
      - think: 60